test_cases/airFoil2D_Re3e6_alpha0/system/FOpressure
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

pressure
{
    // Mandatory entries (unmodifiable)
    type            pressure;
    libs            (fieldFunctionObjects);
    mode            totalCoeff;
    pInf            0.0;
    rho             rhoInf;
    rhoInf          1.0;
    UInf            (30.0 0 0);

    executeControl  writeTime;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   1;
}

// ************************************************************************* //
